Revit 2026 API

# LeaderArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LeaderArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
LeaderArrayIterator()
```
```fsharp
new : unit -> LeaderArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

LeaderArrayIterator Class

Autodesk.Revit.DB Namespace